# Write CSV file

In [1]:
import pandas as pd

dis = {"e": [1,2,3,4,5,6], "s": [11,22,33,44,55,66], "d":[1,2,3,4,5,6]}

d = pd.DataFrame(dis)

print(d)

d.to_csv("Test_new.csv")
d.to_csv("Without_Index", index=False, header= [1,2,3])

   e   s  d
0  1  11  1
1  2  22  2
2  3  33  3
3  4  44  4
4  5  55  5
5  6  66  6

# Read CSV file

In [2]:
csv_1 = pd.read_csv("C:\\Users\\Yash\\Desktop\\I am Gonna Become Data Scientist\\Pandas_Learning\\events_excel.csv")

csv_1

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,NaN
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
...,...,...,...,...,...,...,...,...
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN

In [3]:
csv_2 = pd.read_csv("events_excel.csv",nrows=5)

csv_2

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,NaN
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN

In [4]:
csv_2 = pd.read_csv("events_excel.csv",nrows=5, usecols=["user_id", "location"])

csv_2

   user_id location
0    10522    Japan
1    10522    Japan
2    10522    Japan
3    10522    Japan
4    10522    Japan

In [5]:
csv_3 = pd.read_csv("events_excel.csv",nrows=5, usecols=[0,2,3])

csv_3

   user_id  event_type    event_name
0    10522  engagement         login
1    10522  engagement     home_page
2    10522  engagement  like_message
3    10522  engagement    view_inbox
4    10522  engagement    search_run

In [6]:
csv_4 = pd.read_csv("events_excel.csv",skiprows=[0,3])

csv_4

,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,Unnamed: 7
0,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
1,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
4,10612,01-05-2014 09:59,engagement,login,Netherlands,iphone 5,1,NaN
...,...,...,...,...,...,...,...,...
325248,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325249,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325250,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN

In [7]:
csv_5 = pd.read_csv("events_excel.csv",nrows=5, index_col = "occurred_at")

csv_5

,user_id,event_type,event_name,location,device,user_type,Column1
occurred_at,,,,,,,
02-05-2014 11:02,10522,engagement,login,Japan,dell inspiron notebook,3,NaN
02-05-2014 11:02,10522,engagement,home_page,Japan,dell inspiron notebook,3,NaN
02-05-2014 11:03,10522,engagement,like_message,Japan,dell inspiron notebook,3,NaN
02-05-2014 11:04,10522,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
02-05-2014 11:03,10522,engagement,search_run,Japan,dell inspiron notebook,3,NaN

In [8]:
csv_5 = pd.read_csv("events_excel.csv",nrows=5, header=2)

csv_5

,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,Unnamed: 7
0,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
1,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
4,10612,01-05-2014 09:59,engagement,login,Netherlands,iphone 5,1,NaN

In [9]:
csv_5 = pd.read_csv("events_excel.csv",nrows=5, names=["col1","col2","col3","col4"])

csv_5

                                                      col1  \
user_id occurred_at      event_type event_name    location
10522   02-05-2014 11:02 engagement login            Japan
                                    home_page        Japan
        02-05-2014 11:03 engagement like_message     Japan
        02-05-2014 11:04 engagement view_inbox       Japan

                                                                    col2  \
user_id occurred_at      event_type event_name                    device
10522   02-05-2014 11:02 engagement login         dell inspiron notebook
                                    home_page     dell inspiron notebook
        02-05-2014 11:03 engagement like_message  dell inspiron notebook
        02-05-2014 11:04 engagement view_inbox    dell inspiron notebook

                                                       col3     col4
user_id occurred_at      event_type event_name    user_type  Column1
10522   02-05-2014 11:02 engagement login                 3      NaN
                                    home_page             3      NaN
        02-05-2014 11:03 engagement like_message          3      NaN
        02-05-2014 11:04 engagement view_inbox            3      NaN

## Change the type of Data

In [10]:
csv_5 = pd.read_csv("events_excel.csv",nrows=5, dtype = {"user_type":"float", "user_id":"float"})

csv_5

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
0,10522.0,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3.0,NaN
1,10522.0,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3.0,NaN
2,10522.0,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3.0,NaN
3,10522.0,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3.0,NaN
4,10522.0,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3.0,NaN

# Pandas Fuctions for CSV file

In [11]:
csv_1

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,NaN
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
...,...,...,...,...,...,...,...,...
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN

In [12]:
csv_1.index

RangeIndex(start=0, stop=325255, step=1)

In [13]:
csv_1.columns

# Gives list of all columns

Index(['user_id', 'occurred_at', 'event_type', 'event_name', 'location',
       'device', 'user_type', 'Column1'],
      dtype='object')

In [14]:
csv_1.describe()

# This only gives description for numerical columns

             user_id      user_type  Column1
count  325255.000000  325255.000000      0.0
mean     9723.291682       1.512238      NaN
std      5340.381714       0.754780      NaN
min         4.000000       1.000000      NaN
25%      5018.000000       1.000000      NaN
50%     10636.000000       1.000000      NaN
75%     14110.000000       2.000000      NaN
max     19063.000000       3.000000      NaN

In [15]:
csv_1.head(2)

# Gives top five rows (default) can give argument for the rows

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,NaN
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN

In [16]:
csv_1.tail()

# Gives bottom five rows (default) can give argument for the rows

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN

In [17]:
csv_1[6:11]

# get rows data using the slicing function

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
6,10612,01-05-2014 09:59,engagement,login,Netherlands,iphone 5,1,NaN
7,10612,01-05-2014 10:00,engagement,like_message,Netherlands,iphone 5,1,NaN
8,10612,01-05-2014 10:00,engagement,send_message,Netherlands,iphone 5,1,NaN
9,10612,01-05-2014 10:01,engagement,home_page,Netherlands,iphone 5,1,NaN
10,10612,01-05-2014 10:01,engagement,like_message,Netherlands,iphone 5,1,NaN

In [18]:
csv_1.index.array

<PandasArray>
[     0,      1,      2,      3,      4,      5,      6,      7,      8,
      9,
 ...
 325245, 325246, 325247, 325248, 325249, 325250, 325251, 325252, 325253,
 325254]
Length: 325255, dtype: int64

In [19]:
csv_1.to_numpy()

# Convert dataframe to numpy array method 1

array([[10522, '02-05-2014 11:02', 'engagement', ...,
        'dell inspiron notebook', 3, nan],
       [10522, '02-05-2014 11:02', 'engagement', ...,
        'dell inspiron notebook', 3, nan],
       [10522, '02-05-2014 11:03', 'engagement', ...,
        'dell inspiron notebook', 3, nan],
       ...,
       [18815, '31-08-2014 13:42', 'engagement', ...,
        'dell inspiron notebook', 2, nan],
       [18815, '31-08-2014 13:43', 'engagement', ...,
        'dell inspiron notebook', 2, nan],
       [18815, '31-08-2014 13:43', 'engagement', ...,
        'dell inspiron notebook', 2, nan]], dtype=object)

In [20]:
# Convert dataframe to numpy array method 2
import numpy as np

v = np.asarray(csv_1)
v

array([[10522, '02-05-2014 11:02', 'engagement', ...,
        'dell inspiron notebook', 3, nan],
       [10522, '02-05-2014 11:02', 'engagement', ...,
        'dell inspiron notebook', 3, nan],
       [10522, '02-05-2014 11:03', 'engagement', ...,
        'dell inspiron notebook', 3, nan],
       ...,
       [18815, '31-08-2014 13:42', 'engagement', ...,
        'dell inspiron notebook', 2, nan],
       [18815, '31-08-2014 13:43', 'engagement', ...,
        'dell inspiron notebook', 2, nan],
       [18815, '31-08-2014 13:43', 'engagement', ...,
        'dell inspiron notebook', 2, nan]], dtype=object)

In [21]:
csv_1.sort_index(axis=0, ascending = False)

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
...,...,...,...,...,...,...,...,...
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,NaN

## Change the data

In [22]:
# Method 1

csv_1["Column1"][0] = "python"
csv_1

C:\Users\Yash\AppData\Local\Temp\ipykernel_15108\1642336869.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  csv_1["Column1"][0] = "python"

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,python
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
...,...,...,...,...,...,...,...,...
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN

In [23]:
# Method 2

csv_1.loc[0, "Column1"] = "YashShinde"
csv_1

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,YashShinde
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
...,...,...,...,...,...,...,...,...
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN

In [24]:
# How to use loc for getting complete pertiular columns

csv_1.loc[:,["Column1", "location"]]

           Column1 location
0       YashShinde    Japan
1              NaN    Japan
2              NaN    Japan
3              NaN    Japan
4              NaN    Japan
...            ...      ...
325250         NaN  Ireland
325251         NaN  Ireland
325252         NaN  Ireland
325253         NaN  Ireland
325254         NaN  Ireland

[325255 rows x 2 columns]

In [25]:
# How to use loc for getting complete pertiular rows

csv_1.loc[[2,3],:]

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN

In [26]:
# How to use loc for getting pertiular columns and rows

csv_1.loc[[2,3],["Column1", "location"]]

  Column1 location
2     NaN    Japan
3     NaN    Japan

### Using iloc fucntion

In [27]:
help(csv_1.iloc)

Help on _iLocIndexer in module pandas.core.indexing object:

class _iLocIndexer(_LocationIndexer)
 |  Purely integer-location based indexing for selection by position.
 |
 |  ``.iloc[]`` is primarily integer position based (from ``0`` to
 |  ``length-1`` of the axis), but may also be used with a boolean
 |  array.
 |
 |  Allowed inputs are:
 |
 |  - An integer, e.g. ``5``.
 |  - A list or array of integers, e.g. ``[4, 3, 0]``.
 |  - A slice object with ints, e.g. ``1:7``.
 |  - A boolean array.
 |  - A ``callable`` function with one argument (the calling Series or
 |    DataFrame) and that returns valid output for indexing (one of the above).
 |    This is useful in method chains, when you don't have a reference to the
 |    calling object, but would like to base your selection on some value.
 |
 |  ``.iloc`` will raise ``IndexError`` if a requested indexer is
 |  out-of-bounds, except *slice* indexers which allow out-of-bounds
 |  indexing (this conforms with python/numpy *slice* semantics).
 |
 |  See more at :ref:`Selection by Position <indexing.integer>`.
 |
 |  See Also
 |  --------
 |  DataFrame.iat : Fast integer location scalar accessor.
 |  DataFrame.loc : Purely label-location based indexer for selection by label.
 |  Series.iloc : Purely integer-location based indexing for
 |                 selection by position.
 |
 |  Examples
 |  --------
 |  >>> mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
 |  ...           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
 |  ...           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
 |  >>> df = pd.DataFrame(mydict)
 |  >>> df
 |        a     b     c     d
 |  0     1     2     3     4
 |  1   100   200   300   400
 |  2  1000  2000  3000  4000
 |
 |  **Indexing just the rows**
 |
 |  With a scalar integer.
 |
 |  >>> type(df.iloc[0])
 |  <class 'pandas.core.series.Series'>
 |  >>> df.iloc[0]
 |  a    1
 |  b    2
 |  c    3
 |  d    4
 |  Name: 0, dtype: int64
 |
 |  With a list of integers.
 |
 |  >>> df.iloc[[0]]
 |     a  b  c  d
 |  0  1  2  3  4
 |  >>> type(df.iloc[[0]])
 |  <class 'pandas.core.frame.DataFrame'>
 |
 |  >>> df.iloc[[0, 1]]
 |       a    b    c    d
 |  0    1    2    3    4
 |  1  100  200  300  400
 |
 |  With a `slice` object.
 |
 |  >>> df.iloc[:3]
 |        a     b     c     d
 |  0     1     2     3     4
 |  1   100   200   300   400
 |  2  1000  2000  3000  4000
 |
 |  With a boolean mask the same length as the index.
 |
 |  >>> df.iloc[[True, False, True]]
 |        a     b     c     d
 |  0     1     2     3     4
 |  2  1000  2000  3000  4000
 |
 |  With a callable, useful in method chains. The `x` passed
 |  to the ``lambda`` is the DataFrame being sliced. This selects
 |  the rows whose index label even.
 |
 |  >>> df.iloc[lambda x: x.index % 2 == 0]
 |        a     b     c     d
 |  0     1     2     3     4
 |  2  1000  2000  3000  4000
 |
 |  **Indexing both axes**
 |
 |  You can mix the indexer types for the index and columns. Use ``:`` to
 |  select the entire axis.
 |
 |  With scalar integers.
 |
 |  >>> df.iloc[0, 1]
 |  2
 |
 |  With lists of integers.
 |
 |  >>> df.iloc[[0, 2], [1, 3]]
 |        b     d
 |  0     2     4
 |  2  2000  4000
 |
 |  With `slice` objects.
 |
 |  >>> df.iloc[1:3, 0:3]
 |        a     b     c
 |  1   100   200   300
 |  2  1000  2000  3000
 |
 |  With a boolean array whose length matches the columns.
 |
 |  >>> df.iloc[:, [True, False, True, False]]
 |        a     c
 |  0     1     3
 |  1   100   300
 |  2  1000  3000
 |
 |  With a callable function that expects the Series or DataFrame.
 |
 |  >>> df.iloc[:, lambda df: [0, 2]]
 |        a     c
 |  0     1     3
 |  1   100   300
 |  2  1000  3000
 |
 |  Method resolution order:
 |      _iLocIndexer
 |      _LocationIndexer
 |      pandas._libs.indexing.NDFrameIndexerBase
 |      builtins.object
 |
 |  Methods inherited from _LocationIndexer:
 |
 |  __call__(self, axis=None)
 |      Call self as a function.
 |
 |  __getitem__(self, key)
 |
 |  __setitem__(self, key, value)
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _LocationIndexer:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _LocationIndexer:
 |
 |  __annotations__ = {'_valid_types': 'str'}
 |
 |  axis = None
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  __init__(self, /, *args, **kwargs)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  __reduce__ = __reduce_cython__(...)
 |
 |  __setstate__ = __setstate_cython__(...)
 |
 |  ----------------------------------------------------------------------
 |  Static methods inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  name
 |
 |  ndim
 |
 |  obj

In [28]:
print(csv_1.iloc[0,2])

print(csv_1.iloc[0,7])

engagement
YashShinde

In [29]:
# get columns using iloc function

csv_1.iloc[:,[2,3]]

        event_type    event_name
0       engagement         login
1       engagement     home_page
2       engagement  like_message
3       engagement    view_inbox
4       engagement    search_run
...            ...           ...
325250  engagement  like_message
325251  engagement     home_page
325252  engagement  send_message
325253  engagement     home_page
325254  engagement  like_message

[325255 rows x 2 columns]

In [30]:
# get columns using iloc function

csv_1.iloc[[2,3],:]

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN

In [31]:
# Difference Between loc and iloc is that
# in iloc you can access the columns using the index number of the columns (0, 1,2,3 etc)
# in loc you can't access the columsn using the index number of the columns (0, 1,2,3, etc) you have to use the actual name of the column

In [32]:
# Drop Function

csv_1

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3,YashShinde
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
...,...,...,...,...,...,...,...,...
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN

In [36]:
# Drop Column

csv_1.drop("Column1", axis = 1)

,user_id,occurred_at,event_type,event_name,location,device,user_type
0,10522,02-05-2014 11:02,engagement,login,Japan,dell inspiron notebook,3
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3
...,...,...,...,...,...,...,...
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2

In [37]:
# Drop Row

csv_1.drop(0, axis=0)

,user_id,occurred_at,event_type,event_name,location,device,user_type,Column1
1,10522,02-05-2014 11:02,engagement,home_page,Japan,dell inspiron notebook,3,NaN
2,10522,02-05-2014 11:03,engagement,like_message,Japan,dell inspiron notebook,3,NaN
3,10522,02-05-2014 11:04,engagement,view_inbox,Japan,dell inspiron notebook,3,NaN
4,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
5,10522,02-05-2014 11:03,engagement,search_run,Japan,dell inspiron notebook,3,NaN
...,...,...,...,...,...,...,...,...
325250,18815,31-08-2014 13:41,engagement,like_message,Ireland,dell inspiron notebook,2,NaN
325251,18815,31-08-2014 13:42,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325252,18815,31-08-2014 13:42,engagement,send_message,Ireland,dell inspiron notebook,2,NaN
325253,18815,31-08-2014 13:43,engagement,home_page,Ireland,dell inspiron notebook,2,NaN
325254,18815,31-08-2014 13:43,engagement,like_message,Ireland,dell inspiron notebook,2,NaN